out/production/Assignment3Client/introsde/document/ws/people2.wsdl

<?xml version='1.0' encoding='UTF-8'?><!-- Published by JAX-WS RI at http://jax-ws.dev.java.net. RI's version is JAX-WS RI 2.2.8 svn-revision#13980. --><!-- Generated by JAX-WS RI at http://jax-ws.dev.java.net. RI's version is JAX-WS RI 2.2.8 svn-revision#13980. --><definitions xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:wsp="http://www.w3.org/ns/ws-policy" xmlns:wsp1_2="http://schemas.xmlsoap.org/ws/2004/09/policy" xmlns:wsam="http://www.w3.org/2007/05/addressing/metadata" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:tns="http://ws.document.introsde/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns="http://schemas.xmlsoap.org/wsdl/" targetNamespace="http://ws.document.introsde/" name="PeopleService">
<types>
<xsd:schema>
<xsd:import namespace="http://ws.document.introsde/" schemaLocation="http://localhost:6902/ws/people?xsd=1"/>
</xsd:schema>
</types>
<message name="readPersonList">
<part name="parameters" element="tns:readPersonList"/>
</message>
<message name="readPersonListResponse">
<part name="parameters" element="tns:readPersonListResponse"/>
</message>
<message name="updatePerson">
<part name="parameters" element="tns:updatePerson"/>
</message>
<message name="updatePersonResponse">
<part name="parameters" element="tns:updatePersonResponse"/>
</message>
<message name="createPerson">
<part name="parameters" element="tns:createPerson"/>
</message>
<message name="createPersonResponse">
<part name="parameters" element="tns:createPersonResponse"/>
</message>
<message name="deletePerson">
<part name="parameters" element="tns:deletePerson"/>
</message>
<message name="deletePersonResponse">
<part name="parameters" element="tns:deletePersonResponse"/>
</message>
<message name="readPersonHistory">
<part name="parameters" element="tns:readPersonHistory"/>
</message>
<message name="readPersonHistoryResponse">
<part name="parameters" element="tns:readPersonHistoryResponse"/>
</message>
<message name="readMeasureTypes">
<part name="parameters" element="tns:readMeasureTypes"/>
</message>
<message name="readMeasureTypesResponse">
<part name="parameters" element="tns:readMeasureTypesResponse"/>
</message>
<message name="readPersonMeasures">
<part name="parameters" element="tns:readPersonMeasures"/>
</message>
<message name="readPersonMeasuresResponse">
<part name="parameters" element="tns:readPersonMeasuresResponse"/>
</message>
<message name="savePersonMeasure">
<part name="parameters" element="tns:savePersonMeasure"/>
</message>
<message name="savePersonMeasureResponse">
<part name="parameters" element="tns:savePersonMeasureResponse"/>
</message>
<message name="updatePersonMeasure">
<part name="parameters" element="tns:updatePersonMeasure"/>
</message>
<message name="updatePersonMeasureResponse">
<part name="parameters" element="tns:updatePersonMeasureResponse"/>
</message>
<message name="readPerson">
<part name="parameters" element="tns:readPerson"/>
</message>
<message name="readPersonResponse">
<part name="parameters" element="tns:readPersonResponse"/>
</message>
<portType name="People">
<operation name="readPersonList">
<input wsam:Action="http://ws.document.introsde/People/readPersonListRequest" message="tns:readPersonList"/>
<output wsam:Action="http://ws.document.introsde/People/readPersonListResponse" message="tns:readPersonListResponse"/>
</operation>
<operation name="updatePerson">
<input wsam:Action="http://ws.document.introsde/People/updatePersonRequest" message="tns:updatePerson"/>
<output wsam:Action="http://ws.document.introsde/People/updatePersonResponse" message="tns:updatePersonResponse"/>
</operation>
<operation name="createPerson">
<input wsam:Action="http://ws.document.introsde/People/createPersonRequest" message="tns:createPerson"/>
<output wsam:Action="http://ws.document.introsde/People/createPersonResponse" message="tns:createPersonResponse"/>
</operation>
<operation name="deletePerson">
<input wsam:Action="http://ws.document.introsde/People/deletePersonRequest" message="tns:deletePerson"/>
<output wsam:Action="http://ws.document.introsde/People/deletePersonResponse" message="tns:deletePersonResponse"/>
</operation>
<operation name="readPersonHistory">
<input wsam:Action="http://ws.document.introsde/People/readPersonHistoryRequest" message="tns:readPersonHistory"/>
<output wsam:Action="http://ws.document.introsde/People/readPersonHistoryResponse" message="tns:readPersonHistoryResponse"/>
</operation>
<operation name="readMeasureTypes">
<input wsam:Action="http://ws.document.introsde/People/readMeasureTypesRequest" message="tns:readMeasureTypes"/>
<output wsam:Action="http://ws.document.introsde/People/readMeasureTypesResponse" message="tns:readMeasureTypesResponse"/>
</operation>
<operation name="readPersonMeasures">
<input wsam:Action="http://ws.document.introsde/People/readPersonMeasuresRequest" message="tns:readPersonMeasures"/>
<output wsam:Action="http://ws.document.introsde/People/readPersonMeasuresResponse" message="tns:readPersonMeasuresResponse"/>
</operation>
<operation name="savePersonMeasure">
<input wsam:Action="http://ws.document.introsde/People/savePersonMeasureRequest" message="tns:savePersonMeasure"/>
<output wsam:Action="http://ws.document.introsde/People/savePersonMeasureResponse" message="tns:savePersonMeasureResponse"/>
</operation>
<operation name="updatePersonMeasure">
<input wsam:Action="http://ws.document.introsde/People/updatePersonMeasureRequest" message="tns:updatePersonMeasure"/>
<output wsam:Action="http://ws.document.introsde/People/updatePersonMeasureResponse" message="tns:updatePersonMeasureResponse"/>
</operation>
<operation name="readPerson">
<input wsam:Action="http://ws.document.introsde/People/readPersonRequest" message="tns:readPerson"/>
<output wsam:Action="http://ws.document.introsde/People/readPersonResponse" message="tns:readPersonResponse"/>
</operation>
</portType>
<binding name="PeopleImplementationPortBinding" type="tns:People">
<soap:binding transport="http://schemas.xmlsoap.org/soap/http" style="document"/>
<operation name="readPersonList">
<soap:operation soapAction=""/>
<input>
<soap:body use="literal"/>
</input>
<output>
<soap:body use="literal"/>
</output>
</operation>
<operation name="updatePerson">
<soap:operation soapAction=""/>
<input>
<soap:body use="literal"/>
</input>
<output>
<soap:body use="literal"/>
</output>
</operation>
<operation name="createPerson">
<soap:operation soapAction=""/>
<input>
<soap:body use="literal"/>
</input>
<output>
<soap:body use="literal"/>
</output>
</operation>
<operation name="deletePerson">
<soap:operation soapAction=""/>
<input>
<soap:body use="literal"/>
</input>
<output>
<soap:body use="literal"/>
</output>
</operation>
<operation name="readPersonHistory">
<soap:operation soapAction=""/>
<input>
<soap:body use="literal"/>
</input>
<output>
<soap:body use="literal"/>
</output>
</operation>
<operation name="readMeasureTypes">
<soap:operation soapAction=""/>
<input>
<soap:body use="literal"/>
</input>
<output>
<soap:body use="literal"/>
</output>
</operation>
<operation name="readPersonMeasures">
<soap:operation soapAction=""/>
<input>
<soap:body use="literal"/>
</input>
<output>
<soap:body use="literal"/>
</output>
</operation>
<operation name="savePersonMeasure">
<soap:operation soapAction=""/>
<input>
<soap:body use="literal"/>
</input>
<output>
<soap:body use="literal"/>
</output>
</operation>
<operation name="updatePersonMeasure">
<soap:operation soapAction=""/>
<input>
<soap:body use="literal"/>
</input>
<output>
<soap:body use="literal"/>
</output>
</operation>
<operation name="readPerson">
<soap:operation soapAction=""/>
<input>
<soap:body use="literal"/>
</input>
<output>
<soap:body use="literal"/>
</output>
</operation>
</binding>
<service name="PeopleService">
<port name="PeopleImplementationPort" binding="tns:PeopleImplementationPortBinding">
<soap:address location="http://localhost:6902/ws/people"/>
</port>
</service>
</definitions>