LSCBusinessLogic/src/lsc/businesslogic/client/wsimport.xml

<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
    <SOAP-ENV:Header/>
    <S:Body>
        <ns2:createPerson xmlns:ns2="http://ws.document.introsde/">
            <ns2:person>
                <idPerson>0</idPerson>
                <lastname>Ive</lastname>
                <name>Jony</name>
            </ns2:person>
        </ns2:createPerson>
    </S:Body>
</S:Envelope>
